This behaviour does *not* happen when using Terraform:

Sample Terraform hcl
```terraform
terraform {
  required_version = "~> 1.10.0"
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 5.0"
    }
  }
}

provider "aws" {
  region = "eu-west-2" # Specify your region
}

resource "aws_vpc" "vpc" {
  cidr_block = "10.0.0.0/16"
}

resource "aws_subnet" "subnet" {
  vpc_id     = aws_vpc.vpc.id
  cidr_block = "10.0.1.0/24"
}

resource "aws_security_group" "securityGroup" {
  vpc_id = aws_vpc.vpc.id
}

resource "aws_vpclattice_resource_gateway" "gateway" {
  name               = "gateway"
  vpc_id             = aws_vpc.vpc.id
  subnet_ids         = [aws_subnet.subnet.id]
  security_group_ids = [aws_security_group.securityGroup.id]
}
```

1. Run `terraform apply`
2. Change `"securityGroup"` to `"securityGroupFoo"`
3. Change `  security_group_ids = [aws_security_group.securityGroup.id]` to `  security_group_ids = [aws_security_group.securityGroupFoo.id]`
4. Run `terraform apply`

```
Terraform will perform the following actions:

  # aws_security_group.securityGroup will be destroyed
  # (because aws_security_group.securityGroup is not in configuration)
  - resource "aws_security_group" "securityGroup" {
      - arn                    = "arn:aws:ec2:eu-west-2:052848974346:security-group/sg-07362807d6e7b929b" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-07362807d6e7b929b" -> null
      - ingress                = [] -> null
      - name                   = "terraform-20250505105527956500000001" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "052848974346" -> null
      - revoke_rules_on_delete = false -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-03b1b42ff6dff261a" -> null
    }

  # aws_security_group.securityGroupFoo will be created
  + resource "aws_security_group" "securityGroupFoo" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-03b1b42ff6dff261a"
    }

  # aws_vpclattice_resource_gateway.gateway will be updated in-place
  ~ resource "aws_vpclattice_resource_gateway" "gateway" {
        id                 = "rgw-073fc0b8c9013093d"
        name               = "gateway"
      ~ security_group_ids = [
          - "sg-07362807d6e7b929b",
          + (known after apply),
        ]
      ~ status             = "ACTIVE" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_security_group.securityGroup: Destroying... [id=sg-07362807d6e7b929b]
aws_security_group.securityGroupFoo: Creating...
aws_security_group.securityGroup: Destruction complete after 1s
aws_security_group.securityGroupFoo: Creation complete after 2s [id=sg-02aa08195bc60875a]
aws_vpclattice_resource_gateway.gateway: Modifying... [id=rgw-073fc0b8c9013093d]
aws_vpclattice_resource_gateway.gateway: Modifications complete after 1s [id=rgw-073fc0b8c9013093d]
```